Revit 2024 API
BuiltInFailures.StairRampFailures.RiserCurveTooShort Property
 Riser curve is too short to create nosing on it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RiserCurveTooShort { get; }
Visual Basic
Public Shared ReadOnly Property RiserCurveTooShort As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RiserCurveTooShort {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace